//#include <iostream>
//#include <algorithm> // для std::swap
//
//int main() {
//    
//    int a = 42;
//    int b = 153;
//
//    std::cout << "Исходные значения:\n";
//    std::cout << "a: " << a << "\n"; // На экран будет выведено 42
//    std::cout << "b: " << b << "\n"; // На экран будет выведено 153
//
//    // Меняем значения
//    std::swap(a, b);
//
//    std::cout << "Значения после обмена:\n";
//    std::cout << "a: " << a << "\n"; // На экран будет выведено 153
//    std::cout << "b: " << b << "\n"; // На экран будет выведено 42
//
//    return 0;
//}